IDEA StatiCa Open Model
ReinforcedCrossSection.TendonBars Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Tendon bars
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<TendonBar> TendonBars { get; set; }
Public Property TendonBars As List(Of TendonBar)
	Get
	Set
public:
property List<TendonBar^>^ TendonBars {
	List<TendonBar^>^ get ();
	void set (List<TendonBar^>^ value);
}
Property Value
Type: List<TendonBar>
See Also
Reference
ReinforcedCrossSection Class
IdeaRS.OpenModel.CrossSection Namespace